tap "homebrew/bundle"

################################################################################
# Desktop
################################################################################

########################################
## Services
########################################

#cask "meetingbar"
cask "stats"
cask "betterdisplay"
#cask "keepingyouawake"
# TODO: amphetamine?

########################################
## Desktop applications
########################################


####################
### Productivity
####################

cask "obsidian"


################################################################################
# Development
################################################################################

####################
### Development libraries
####################

brew "cmake"
brew "libtool"
brew "pkg-config"

################################################################################
### CLI
################################################################################

####################
### Core CLI tools
####################

brew "coreutils"
brew "rsync"
brew "htop"
brew "dust"
brew "fd"
brew "bat"
brew "fzf"
brew "watch"
brew "zoxide"

####################
### Terminal infrastructure
####################

brew "chezmoi"
brew "tmux"
brew "atuin"
brew "starship"

####################
### Text/data processing
####################

brew "jq"
brew "yq"
brew "ripgrep"

#### Development tools

brew "direnv"
brew "git"
brew "d2"
brew "tealdeer"
brew "watchexec"
brew "pre-commit"

##### Language tools

brew "shellcheck"
brew "yamllint"

#### Misc tools

brew "pv"
brew "ipcalc"

################################################################################
### Editors and workspaces
################################################################################

brew "neovim"
cask "alacritty"
cask "visual-studio-code"

####################
### Fonts
####################

#cask "font-roboto-mono-for-powerline"
cask "font-roboto-mono-nerd-font"

####################
### Containers
####################

brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-buildx"


brew "kubectl"
brew "krew"

brew "helm"
brew "kustomize"
brew "flux"

brew "docker-ls"
brew "cdebug"

####################
### Security
####################

brew "ykman"
brew "yubico-piv-tool"
brew "keychain"

####################
### System
####################

# Required for versions of SSH that support SSH resident keys
brew "openssh"
