tap "homebrew/bundle"
tap "homebrew/cask-fonts"

################################################################################
# Desktop
################################################################################

########################################
## Services
########################################

#cask "meetingbar"
cask "stats"
cask "betterdisplay"
cask "enpass"
cask "keepingyouawake"

########################################
## Desktop applications
########################################

####################
### Web
####################

cask "firefox"
cask "google-chrome"
cask "tor-browser"

####################
### Productivity
####################

cask "obsidian"
cask "anki"
cask "qgis"
cask "prusaslicer"
cask "todoist"

####################
## Communications
####################

cask "slack"
cask "discord"
cask "signal"
cask "zoom"

########################################
## Media
########################################

####################
### Entertainment
####################

cask "steam"

####################
### Audio
####################

cask "spotify"
cask "beardedspice"

####################
### Books
####################

cask "kindle"
cask "calibre"

################################################################################
# Development
################################################################################

####################
### Development libraries
####################

brew "cmake"
brew "libtool"
brew "pkg-config"

################################################################################
### CLI
################################################################################

####################
### Core CLI tools
####################

brew "coreutils"
brew "rsync"
brew "htop"
brew "dust"
brew "fd"
brew "bat"
brew "fzf"
brew "watch"

####################
### Terminal infrastructure
####################

brew "chezmoi"
brew "tmux"
brew "atuin"

####################
### Text/data processing
####################

brew "jq"
brew "yq"
brew "ripgrep"


#### Development tools

brew "direnv"
brew "git"
brew "d2"
brew "tealdeer"
brew "watchexec"
brew "pre-commit"

##### Language tools

brew "shellcheck"
brew "yamllint"

#### Misc tools

brew "pv"
brew "ipcalc"
brew "task"
brew "timewarrior"

################################################################################
### Editors and workspaces
################################################################################

brew "neovim"
cask "alacritty"
cask "visual-studio-code"

####################
### Fonts
####################

cask "font-roboto-mono-for-powerline"
cask "font-roboto-mono-nerd-font"

####################
### Containers
####################

brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-buildx"


brew "kubectl"
brew "krew"

brew "helm"
brew "kustomize"
brew "flux"

brew "docker-ls"
brew "cdebug"

####################
### Security
####################

brew "ykman"
brew "yubico-piv-tool"
brew "vault"
brew "keychain"
brew "gpg2"
brew "vault"

####################
### System
####################

# Required for versions of SSH that support SSH resident keys
brew "openssh"

### Backups

brew "kopia"
cask "kopiaui"

### Network

cask "zerotier-one"
brew "nmap"
brew "wireguard-go"
brew "wireguard-tools"
